/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: agalavan <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/01/11 11:02:25 by agalavan          #+#    #+#             */
/*   Updated: 2018/01/11 11:02:28 by agalavan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int		main(void)
{
	// setlocale(LC_ALL, "");
	wchar_t *value = L"ЇїЇ абабагаламага";
	wchar_t *value2 = L"我是一只猫。";
	wchar_t value3 = L'我';
	ft_printf("Bla Bla %#10.2x\n", 1234);
	   printf("Bla Bla %+010i\n", 1234);
	

	printf("%####-----++++S %##s \n", 12);

	return (0);
}
